In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('carprices.csv')
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

In [3]:
for i in df['Mileage']:
    print (i + 3)

69003
35003
57003
22503
46003
59003
52003
72003
91003
67003
83003
79003
59003
58783
82453
25403
28003
69003
87603
52003

In [5]:
for col in df.columns[1:3]:
    print(df[col][0:3])

0    6
1    3
2    5
Name: Age(yrs), dtype: int64
0    18000
1    34000
2    26100
Name: Sell Price($), dtype: int64

In [7]:
for a in df.columns:
    print(a)

Mileage
Age(yrs)
Sell Price($)

In [ ]:
#vals = [] # Create an empty list to hold the requested values
#for i in range(len(df['loc'])): # Loop over the rows ('i')
    #val = df.iloc[i, df['loc'][i]] # Get the requested value from row 'i'
    #vals.append(val) # append value to list 'vals'
#df['value'] = vals # Add list 'vals' as a new column to the DataFrame

In [8]:
mil = []
for i in df['Age(yrs)']:
    i=i+4
    mil.append(i)
df['Age(yrs)']=mil

In [9]:
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000        10          18000
1    35000         7          34000
2    57000         9          26100
3    22500         6          40000
4    46000         8          31500